benjaminkravets/KW45B41Z/kw45b41zevk_beacon_bm/drivers/fsl_sfa.c
/*
 * Copyright 2019-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_sfa.h"

/*
 * $Coverage Justification Reference$
 *
 * $Justification sfa_c_ref_1$
 * The peripheral base address is always valid and checked by assert.
 *
 * $Justification sfa_c_ref_2$
 * If the incoming base can not make (1U == FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base) is true,
 * The following statement will not be executed.
 *
 * $Justification sfa_c_ref_3$
 * If the incoming base can not make (1U == FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base) is true,
 * The connection of the clock under test to the external pin will not be enabled.
 *
 * $Justification sfa_c_ref_4$
 * while ((base->CNT_STAT & SFA_CNT_STAT_CUT_STOPPED_MASK) == 0U) not covered. Test unfeasible,
 * The CUT counter stop state is too short not to catch.
 *
 * $Justification sfa_c_ref_5$
 * ((mode != kSFA_CUTPeriodMeasurement || mode != kSFA_TriggerBasedMeasurement) not covered.
 * All status are covered above.
 *
 * $Justification sfa_c_ref_6$
 * Switch (!= mode) not covered. Other modes cannot be executed.
 *
 * $Justification sfa_c_ref_7$
 * (flags & (uint32_t)kSFA_RefStoppedFlag) == 0U) not covered. Test unfeasible,
 * the reference counter stopped flag state is too short not to catch.
 *
 */

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.sfa"
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * brief Get the instance from the base address.
 *
 * param base SFA peripheral base address.
 *
 * return The SFA instance.
 */
static uint8_t SFA_GetInstance(SFA_Type *base);

/*!
 * brief Start to measure the frequency of the clock under test.
 *
 * This function starts to measure the frequency of select CUT source.
 * This function does not return until the measurement starts.
 *
 * note If the CUT frequency > REF frequency, it is recommended CUT target be set to 0xFFFF_FFFF.
 *
 *  param base SFA peripheral base address.
 */
static void SFA_StartMeasureFrequency(SFA_Type *base);

/*!
 * brief Start to measure the period of the clock under test or the time between triggers.
 *
 * This function starts to measure the period of the selected CUT source or the time of the selected triggers.
 * This function does not return until the measurement starts.
 *
 * param base SFA peripheral base address.
 */
static void SFA_StartMeasurePeriod(SFA_Type *base);

/*!
 * brief Calculate the frequency of the selected CUT source when the selected mode is mode0.
 *
 * This function calculate the frequency of CUT in mode0 (when CUT frequency < REF frequency).
 *
 * note The unit of this function return value is HZ.
 *
 * param base SFA peripheral base address.
 * param refFrequency reference clock frequency (BUS clock frequency)
 */
static uint32_t SFA_Mode0Calculate(SFA_Type *base, uint32_t refFrequency);

/*!
 * brief Calculate the frequency of the selected CUT source when the selected mode is mode1.
 *
 * This function calculate the frequency of CUT in mode1 (when CUT frequency > REF frequency).
 *
 * note The unit of this function return value is HZ.
 *
 * param base SFA peripheral base address.
 * param refFrequency reference clock frequency (BUS clock frequency)
 */
static uint32_t SFA_Mode1Calculate(SFA_Type *base, uint32_t refFrequency);

/*!
 * brief Calculate the period of the selected CUT source in mode2 or the time of the selected triggers in mode3.
 *
 * In mode2 this function calculate the period of the selected CUT source.
 * In mode3 this function calculate the time of the selected triggers.
 *
 * note The return data is multiple of the reference clock.
 *
 * param base SFA peripheral base address.
 */
static uint32_t SFA_Mode2Mode3Calculate(SFA_Type *base);

/*!
 * brief Measure Frequency in blocking mode.
 *
 * param base SFA peripheral base address.
 * param mode SFA measurement mode.
 *
 * retval kStatus_SFA_ReferenceCounterTimeout error happens.
 * retval kStatus_SFA_MeasurementCompleted measure completes.
 * retval kStatus_SFA_CUTCounterTimeout error happens.
 */
static status_t SFA_MeasureFrequencyBlocking(SFA_Type *base, sfa_measurement_mode_t mode);

/*!
 * brief Measure Period in blocking mode.
 *
 * param base SFA peripheral base address.
 *
 * retval kStatus_SFA_ReferenceCounterTimeout error happens.
 * retval kStatus_SFA_MeasurementCompleted measure completes.
 */
static status_t SFA_MeasurePeriodBlocking(SFA_Type *base);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! brief Pointers to SFA bases for each instance. */
static SFA_Type *const s_sfaBases[] = SFA_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! brief Pointer to SFA clocks for each instance. */
static clock_ip_name_t const s_sfaClocks[] = SFA_CLOCKS;
#endif /*FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL*/

static sfa_callback_t s_sfaIsr[FSL_FEATURE_SOC_SFA_COUNT];

/*******************************************************************************
 * Code
 ******************************************************************************/

static uint8_t SFA_GetInstance(SFA_Type *base)
{
    uint8_t instance;

    /* Find the instance index from base address mappings. */
    /*
     * $Branch Coverage Justification$
     * (instance >= ARRAY_SIZE(s_sfaBases)) not covered.
     * $ref sfa_c_ref_1$.
     */
    for (instance = 0U; instance < ARRAY_SIZE(s_sfaBases); instance++)
    {
        /*
         * $Branch Coverage Justification$
         * (s_sfaBases[instance] != base) not covered.
         * $ref sfa_c_ref_1$.
         */
        if (s_sfaBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_sfaBases));

    return instance;
}

static void SFA_StartMeasureFrequency(SFA_Type *base)
{
    bool triggerable = false;

