benjaminkravets/KW45B41Z/kw45b41zevk_beacon_bm/drivers/fsl_sfa.c
#if defined(RF_SFA)
    /*
     * $Branch Coverage Justification$
     * (1U != FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base) not covered.
     * $ref sfa_c_ref_2$.
     */
    if (1 == FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base))
    {
        /*
         * $Line Coverage Justification$
         * $ref sfa_c_ref_2$.
         */
        triggerable = ((base->CTRL & SFA_CTRL_SFA_TRIG_MEAS_EN_MASK) != 0U);
    }
#endif

    (*(volatile uint32_t *)&(base->REF_CNT)) = 0U; /* Dummy write to REF counter. */

    /* Poll the CUT_STOPPED bit to make sure it cleared. */
    /*
     * $Branch Coverage Justification$
     * $ref sfa_c_ref_4$.
     */
    while ((base->CNT_STAT & SFA_CNT_STAT_CUT_STOPPED_MASK) != 0U)
    {
        ;
    }
    /*
     * $Branch Coverage Justification$
     * (true == triggerable) not covered. The trigger measurement function does not have enable.
     */
    if (!triggerable)
    {
        (*(volatile uint32_t *)&(base->CUT_CNT)) = 0U; /* Dummy write to CUT counter. */
        while (0U == (base->CNT_STAT & SFA_CNT_STAT_MEAS_STARTED_MASK))
        {
            ; /* Loop until measurement start. */
        }
    }
}

static void SFA_StartMeasurePeriod(SFA_Type *base)
{
    (*(volatile uint32_t *)&(base->REF_CNT)) = 0U; /* Dummy write to REF counter. */
    /*
     * $Branch Coverage Justification$
     * $ref sfa_c_ref_4$.
     */
    while ((base->CNT_STAT & SFA_CNT_STAT_CUT_STOPPED_MASK) != 0U)
    {
        ;
    }

    while (0U == (base->CNT_STAT & SFA_CNT_STAT_MEAS_STARTED_MASK))
    {
        ; /* Loop until measurement start. */
    }
}

static uint32_t SFA_Mode0Calculate(SFA_Type *base, uint32_t refFrequency)
{
    uint64_t frequency;
    uint8_t prediv;

    prediv    = SFA_GetCUTPredivide(base);
    frequency = ((uint64_t)SFA_GetCUTCounter(base) - 1ULL) * (uint64_t)refFrequency;
    frequency += (((uint64_t)SFA_GetREFEndCount(base) - (uint64_t)SFA_GetREFStartCount(base))) >> 1;
    frequency /= ((uint64_t)SFA_GetREFEndCount(base) - (uint64_t)SFA_GetREFStartCount(base));
    if (prediv > 1U)
    {
        /* If the cut predivide is provided. */
        frequency *= prediv;
    }
    return (uint32_t)frequency;
}

static uint32_t SFA_Mode1Calculate(SFA_Type *base, uint32_t refFrequency)
{
    uint64_t frequency;
    uint8_t prediv;

    prediv    = SFA_GetCUTPredivide(base);
    frequency = ((uint64_t)SFA_GetCUTCounter(base) - 1ULL) * (uint64_t)refFrequency;
    frequency /= (uint64_t)SFA_GetREFTargetCount(base);
    if (prediv > 1U)
    {
        /* If the cut predivide is provided. */
        frequency *= prediv;
    }
    return (uint32_t)frequency;
}

static uint32_t SFA_Mode2Mode3Calculate(SFA_Type *base)
{
    uint32_t count;
    uint8_t prediv;

    prediv = SFA_GetCUTPredivide(base);
    count  = SFA_GetREFEndCount(base) - SFA_GetREFStartCount(base);
    if (prediv > 1U)
    {
        /* If the cut predivide is provided. */
        count /= prediv;
    }
    return count;
}

static status_t SFA_MeasureFrequencyBlocking(SFA_Type *base, sfa_measurement_mode_t mode)
{
    status_t status = kStatus_Success;

    if (mode == kSFA_FrequencyMeasurement0)
    {
        while (((base->CNT_STAT & SFA_CNT_STAT_REF_STOPPED_MASK) == 0U) ||
               ((base->CNT_STAT & SFA_CNT_STAT_CUT_STOPPED_MASK) == 0U))
        {
            ;
        }
        if ((base->CNT_STAT & SFA_CNT_STAT_REF_CNT_TIMEOUT_MASK) != 0U)
        {
            /* REF counter reached the target before CUT counter reaching target,
             * Reference clock timeout occurred. */
            status = kStatus_SFA_ReferenceCounterTimeout;
        }
        else
        {
            status = kStatus_SFA_MeasurementCompleted;
        }
    }
    else
    {
        while (0U == (base->CNT_STAT & SFA_CNT_STAT_CUT_STOPPED_MASK))
        {
            ;
        }
        if ((base->CUT_CNT) < (base->CUT_TARGET))
        {
            status = kStatus_SFA_MeasurementCompleted;
        }
        else
        {
            /* CUT counter reached target, CUT timeout occurred. */
            status = kStatus_SFA_CUTCounterTimeout;
        }
    }
    return status;
}

static status_t SFA_MeasurePeriodBlocking(SFA_Type *base)
{
    status_t status = kStatus_Success;

    while (0U == (base->CNT_STAT & SFA_CNT_STAT_REF_STOPPED_MASK))
    {
        ;
    }
    if ((base->CNT_STAT & SFA_CNT_STAT_REF_CNT_TIMEOUT_MASK) != 0U)
    {
        /* REF counter reached the target before SFA receiving a full period or
         * before receiving trigger end signal. */
        status = kStatus_SFA_ReferenceCounterTimeout;
    }
    else
    {
        status = kStatus_SFA_MeasurementCompleted;
    }
    return status;
}

/*!
 * brief Clear the SFA status flags.
 *
 * note To clear kSFA_RefStoppedFlag, kSFA_CUTStoppedFlag, kSFA_MeasurementStartedFlag, and
 * kSFA_ReferenceCounterTimeOutFlag, each counter will also be cleared.
 *
 * param base SFA peripheral base address.
 * param mask SFA status flag mask (see @ref _sfa_status_flags for bit definition).
 */
void SFA_ClearStatusFlag(SFA_Type *base, uint32_t mask)
{
    /* Clear interrupt status flag */
    base->CNT_STAT =
        (mask & (SFA_CNT_STAT_SFA_IRQ_MASK | SFA_CNT_STAT_FREQ_GT_MAX_IRQ_MASK | SFA_CNT_STAT_FREQ_LT_MIN_IRQ_MASK));

    if ((mask & ((uint32_t)kSFA_RefStoppedFlag | (uint32_t)kSFA_CutStoppedFlag | (uint32_t)kSFA_MeasurementStartedFlag |
                 (uint32_t)kSFA_ReferenceCounterTimeOutFlag)) != 0UL)
    {
        /* Dummy write REF counter to clear each counter, kSFA_RefStoppedFlag, kSFA_CutStoppedFlag,
         kSFA_MeasurementStartedFlag, kSFA_ReferenceCounterTimeOutFlag. */
        (*(volatile uint32_t *)&(base->REF_CNT)) = 0U;
    }
}

/*!
 * brief Fill the SFA configuration structure with default settings.
 *
 * The default values are:
 * code
 *      config->mode = kSFA_FrequencyMeasurement0;
 *      config->cutSelect = kSFA_CUTSelect0;
 *      config->refSelect = kSFA_REFSelect0;
 *      config->prediv = 0U;
 *      config->trigStart = kSFA_TriggerStartSelect0;
 *      config->startPolarity = kSFA_TriggerStartPolarityRiseEdge;
 *      config->trigEnd = kSFA_TriggerEndSelect0;
 *      config->endPolarity = kSFA_TriggerEndPolarityRiseEdge;
 *      config->enableTrigMeasurement = false;
 *      config->enableCUTPin = false;
 *      config->cutTarget = 0xffffU;
 *      config->refTarget = 0xffffffffU;
 * endcode
 *
 * param config Pointer to the user configuration structure.
 */
void SFA_GetDefaultConfig(sfa_config_t *config)
{
    assert(config);

    (void *)memset(config, 0, sizeof(*config));

    config->mode                  = kSFA_FrequencyMeasurement0;
    config->cutSelect             = kSFA_CUTSelect0;
    config->refSelect             = kSFA_REFSelect0;
    config->prediv                = 0U;
    config->trigStart             = kSFA_TriggerStartSelect0;
    config->startPolarity         = kSFA_TriggerStartPolarityRiseEdge;
    config->trigEnd               = kSFA_TriggerEndSelect0;
    config->endPolarity           = kSFA_TriggerEndPolarityRiseEdge;
    config->enableTrigMeasurement = false;
    config->enableCUTPin          = false;
    config->cutTarget             = 0xffffU;
    config->refTarget             = 0xffffffffU;
}

/*!
 * brief Initialize SFA.
 *
 * param base SFA peripheral base address.
 */
void SFA_Init(SFA_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_EnableClock(s_sfaClocks[SFA_GetInstance(base)]);
#endif /*FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL*/

    /* dummy write REF_CNT to clear each counters and status flags */
    (*(volatile uint32_t *)&(base->REF_CNT)) = 0U;
}

/*!
 * brief Clear counter, disable SFA and gate the SFA clock.
 *
 * param base SFA peripheral base address.
 */
void SFA_Deinit(SFA_Type *base)
{
    (*(volatile uint32_t *)&(base->REF_CNT)) = 0U; /* Dummy write REF counter to clear flags and counters. */
    while ((base->CNT_STAT & SFA_CNT_STAT_CUT_STOPPED_MASK) != 0U)
    {
        ;
    }
    base->CTRL &= ~SFA_CTRL_SFA_EN_MASK;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_DisableClock(s_sfaClocks[SFA_GetInstance(base)]);
#endif /*FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL*/
}

/*!
 * brief Set Measurement options with the passed in configuration structure.
 *
 * param base SFA peripheral base address.
 * param config SFA configuration structure.
 */
void SFA_SetMeasureConfig(SFA_Type *base, const sfa_config_t *config)
{
    assert(config);
    assert(((1 != FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base)) &&
            ((config->refSelect < kSFA_REFSelect2) && (config->cutSelect < kSFA_CUTSelect2))) ||
           (1 == FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base)));
    assert(((1 != FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base)) && (config->mode < kSFA_TriggerBasedMeasurement)) ||
           (1 == FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base)));

    sfa_measurement_mode_t mode;

