benjaminkravets/KW45B41Z/kw45b41zevk_beacon_bm/drivers/fsl_sfa.c
    mode = (sfa_measurement_mode_t)SFA_GetMode(base);

    SFA_EnableInterrupts(base, (uint32_t)kSFA_InterruptEnable);

    if (mode == kSFA_FrequencyMeasurement0 || mode == kSFA_FrequencyMeasurement1)
    {
        SFA_StartMeasureFrequency(base);
    }
    /*
     * $Branch Coverage Justification$
     * $ref sfa_c_ref_5$.
     */
    else if (mode == kSFA_CUTPeriodMeasurement || mode == kSFA_TriggerBasedMeasurement)
    {
        SFA_StartMeasurePeriod(base);
    }
    else
    {
        /* Add comments to prevent the case of MISRA C-2012 ruel 15.7. */
    }
}

/*!
 * brief Abort SFA measurement sequence.
 *
 * This function will clear each counters and each status flags firstly, and then disable SFA.
 *
 * param base SFA peripheral base address.
 */
void SFA_AbortMeasureSequence(SFA_Type *base)
{
    /* Dummy write REF counter to clear each counters and status flags. */
    (*(volatile uint32_t *)&(base->REF_CNT)) = 0U;
    base->CTRL &= ~SFA_CTRL_SFA_EN_MASK;
}

/*!
 * brief Calculate the frequency or period.
 *
 * This funcion will calculate the frequency or period based on configged measure mode.
 * This function must be invoked after the measurement completes.
 *
 * note This function returns frequency with Hz as the unit when used to calculate frequency.
 * note This function returns period with the counts of reference clock when used to calculate period or triggers time.
 *
 * param base SFA peripheral base address.
 * param refFrequency The reference clock frequency(BUS clock recommended).
 */
uint32_t SFA_CalculateFrequencyOrPeriod(SFA_Type *base, uint32_t refFrequency)
{
    sfa_measurement_mode_t mode;
    uint32_t result;

    mode = (sfa_measurement_mode_t)SFA_GetMode(base);
    /*
     * $Branch Coverage Justification$
     * $ref sfa_c_ref_6$.
     */
    switch (mode)
    {
        case kSFA_FrequencyMeasurement0:
        {
            result = SFA_Mode0Calculate(base, refFrequency);
            break;
        }
        case kSFA_FrequencyMeasurement1:
        {
            result = SFA_Mode1Calculate(base, refFrequency);
            break;
        }
        case kSFA_CUTPeriodMeasurement:
        case kSFA_TriggerBasedMeasurement:
        {
            result = SFA_Mode2Mode3Calculate(base);
            break;
        }
            /*
             * $Line Coverage Justification$
             * $ref sfa_c_ref_6$.
             */
        default:
            assert(false);
            break;
    }
    return result;
}

/*!
 * brief Common IRQ handler for each instance.
 *
 * If enable SFA IRQ, this function will be invoked when the measurement is complete.
 * The installed callback function will be invoked with status as the parameter.
 *
 * param base SFA peripheral base address.
 */
static void SFA_CommonIRQHandler(SFA_Type *base)
{
    uint8_t instance;
    sfa_measurement_mode_t mode;
    status_t status = kStatus_Success;
    uint32_t flags;

    instance = (uint8_t)SFA_GetInstance(base);
    flags    = SFA_GetStatusFlags(base);

    assert(s_sfaIsr[instance]);

    if ((flags & (uint32_t)kSFA_InterruptRequestFlag) != 0U)
    {
        mode = (sfa_measurement_mode_t)SFA_GetMode(base);

        SFA_ClearStatusFlag(base, (uint32_t)kSFA_InterruptRequestFlag);
        SFA_DisableInterrupts(base, (uint32_t)kSFA_InterruptEnable);
        /*
         * $Branch Coverage Justification$
         * $ref sfa_c_ref_6$.
         */
        switch (mode)
        {
            case kSFA_FrequencyMeasurement0:
            {
                /*
                 * $Branch Coverage Justification$
                 * ((flags & ((uint32_t)kSFA_RefStoppedFlag | (uint32_t)kSFA_CutStoppedFlag)) == 0U) not covered. Test
                 * unfeasible, the Reference counter stopped flag and CUT counter stopped flag state is too short to
                 * catch.
                 */
                if ((flags & ((uint32_t)kSFA_RefStoppedFlag | (uint32_t)kSFA_CutStoppedFlag)) != 0U)
                {
                    status = kStatus_SFA_MeasurementCompleted;
                }
                /*
                 * $Branch Coverage Justification$
                 * ((flags & (uint32_t)kSFA_ReferenceCounterTimeOutFlag) == 0U) not covered. Test unfeasible,
                 * the Reference counter time out flag state is too short to catch.
                 */
                if ((flags & (uint32_t)kSFA_ReferenceCounterTimeOutFlag) != 0U)
                {
                    status = kStatus_SFA_ReferenceCounterTimeout;
                }
                break;
            }
            case kSFA_FrequencyMeasurement1:
            {
                /*
                 * $Branch Coverage Justification$
                 * $ref sfa_c_ref_7$.
                 */
                if ((flags & (uint32_t)kSFA_RefStoppedFlag) != 0U)
                {
                    status = kStatus_SFA_MeasurementCompleted;
                }
                if (SFA_GetCUTCounter(base) >= SFA_GetCUTTargetCount(base))
                {
                    status = kStatus_SFA_CUTCounterTimeout;
                }
                break;
            }
            case kSFA_CUTPeriodMeasurement:
            case kSFA_TriggerBasedMeasurement:
            {
                /*
                 * $Branch Coverage Justification$
                 * $ref sfa_c_ref_7$.
                 */
                if ((flags & (uint32_t)kSFA_RefStoppedFlag) != 0U)
                {
                    status = kStatus_SFA_MeasurementCompleted;
                }
                if ((flags & (uint32_t)kSFA_ReferenceCounterTimeOutFlag) != 0U)
                {
                    status = kStatus_SFA_ReferenceCounterTimeout;
                }
                break;
            }
                /*
                 * $Line Coverage Justification$
                 * $ref sfa_c_ref_6$.
                 */
            default:
                assert(false);
                break;
        }
    }
    else if ((flags & (uint32_t)kSFA_FreqLessThanMinInterruptFlag) != 0U)
    {
        SFA_ClearStatusFlag(base, (uint32_t)kSFA_FreqLessThanMinInterruptFlag);
        SFA_DisableInterrupts(base, (uint32_t)kSFA_FreqLessThanMinInterruptEnable);
        status = kStatus_SFA_CUTClockFreqLessThanMinLimit;
    }
    /*
     * $Branch Coverage Justification$
     * ((flags & (uint32_t)kSFA_FreqGreaterThanMaxInterruptFlag) == 0U) not covered. All status are covered above.
     */
    else if ((flags & (uint32_t)kSFA_FreqGreaterThanMaxInterruptFlag) != 0U)
    {
        SFA_ClearStatusFlag(base, (uint32_t)kSFA_FreqGreaterThanMaxInterruptFlag);
        SFA_DisableInterrupts(base, (uint32_t)kSFA_FreqGreaterThanMaxInterruptEnable);
        status = kStatus_SFA_CUTClockFreqGreaterThanMaxLimit;
    }
    else
    {
        /* Add comments to prevent the case of MISRA C-2012 ruel 15.7. */
    }

    s_sfaIsr[instance](status);

    SDK_ISR_EXIT_BARRIER;
}

#if defined(SFA0)
void SFA0_DriverIRQHandler(void);
void SFA0_DriverIRQHandler(void)
{
    SFA_CommonIRQHandler(SFA0);
}
#endif

#if defined(RF_SFA)
void RF_SFA_DriverIRQHandler(void);
void RF_SFA_DriverIRQHandler(void)
{
    SFA_CommonIRQHandler(RF_SFA);
}
#endif
